package razerdp.friendcircle.app.bmob;

import com.socks.library.KLog;

/**
 * Created by 大灯泡 on 2016/10/28.
 * <p>
 * 图片
 */

public class BmobTestDatasHelper {

    /**
     * 图源：简书。。。。希望不会被告←_←
     */
    private static final String[] IMAGES = {
            "http://upload-images.jianshu.io/upload_images/2998302-0d749e810c5fdf2d.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-224218e2ab18d8c1.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-3066d349f317b411.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-4dd9020614a28222.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-876065b6599b9a0e.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-a48103a0f0f93549.jpg",
            "http://upload-images.jianshu.io/upload_images/2998302-f41d21d654b5fcb7.jpg",
            "http://upload-images.jianshu.io/upload_images/1094967-218da93f9d04b868.png",
            "http://upload-images.jianshu.io/upload_images/1094967-218da93f9d04b868.png",
            "http://upload-images.jianshu.io/upload_images/3407413-595de8691d95c5f2.JPG",
            "http://upload-images.jianshu.io/upload_images/3407413-595de8691d95c5f2.JPG",
            "http://upload-images.jianshu.io/upload_images/2305435-02b4a77c854531ac",
            "http://upload-images.jianshu.io/upload_images/2305435-02b4a77c854531ac",
            "http://upload-images.jianshu.io/upload_images/2305435-465ef7d3aedcad65.jpg",
            "http://upload-images.jianshu.io/upload_images/2305435-4cc062c9b4dd3846",
            "http://upload-images.jianshu.io/upload_images/2305435-d13ed150425e6f0b.jpg",
            "http://upload-images.jianshu.io/upload_images/2305435-e5f7ad6695a9733e",
            "http://upload-images.jianshu.io/upload_images/2394852-4a85d0bc2c2cba11.jpeg",
            "http://upload-images.jianshu.io/upload_images/2394852-4d8798aadc8e8a83.jpeg",
            "http://upload-images.jianshu.io/upload_images/2394852-6c1e90c78135cf16.jpeg",
            "http://upload-images.jianshu.io/upload_images/2394852-d8b03aad550e45b9.jpg",
            "http://upload-images.jianshu.io/upload_images/2394852-e4577e20f939f9db.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-169e3b55cf87591b.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-2fcd8a2c218ddc64.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-3417b00bd490692d.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-3f02a462eac81455.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-40aad9aa17fdda4f.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-4debfae4d0aa40e7.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-80bd86af776d63f8.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-9ae37d3a6b90eef0.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-ae1758a5397ae419.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-b3f145b0ed0c8884.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-ba3e1d879560e2db.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-c7d3a87236bf332c.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-dd01f8a24da81658.jpg",
            "http://upload-images.jianshu.io/upload_images/2363650-e80ff0e770582cf5.jpg",
            "http://upload-images.jianshu.io/upload_images/3419765-344095e66f9bf746.jpg",
            "http://upload-images.jianshu.io/upload_images/1762807-1c66498cc863b2b4.jpg",
            "http://upload-images.jianshu.io/upload_images/1762807-2aced01395881a43.jpg",
            "http://upload-images.jianshu.io/upload_images/1762807-33f0589ac2f6b37e.jpg",
            "http://upload-images.jianshu.io/upload_images/1762807-34810317833eedee.jpg",
            "http://upload-images.jianshu.io/upload_images/1762807-d692fe1b90ff7bd6.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-017b49fff1865646.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-12e6245024f645ae.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-18a58daff330126f.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-3c71789853c5a33c.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-53c0283d10beb00a.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-9fecb533a8f76dd0.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-aaef0436efec4803.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-cfc79b5247dda0f5.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-dbb93422216523f1.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-de83682efccdd2fe.jpg",
            "http://upload-images.jianshu.io/upload_images/3400546-ea84647171382c82.jpeg",
            "http://upload-images.jianshu.io/upload_images/3400546-f80bcbb4bedcecf9.jpg",
            "http://upload-images.jianshu.io/upload_images/2284556-0a52ed07a16dbb18",
            "http://upload-images.jianshu.io/upload_images/2284556-186d5416054d9a7e",
            "http://upload-images.jianshu.io/upload_images/2284556-1f675f28d3ec9084",
            "http://upload-images.jianshu.io/upload_images/2284556-24039145c27a7caf",
            "http://upload-images.jianshu.io/upload_images/2284556-2667c606a4c7e551",
            "http://upload-images.jianshu.io/upload_images/2284556-3202879e5f15d8db",
            "http://upload-images.jianshu.io/upload_images/2284556-57e48eb19e36fb95",
            "http://upload-images.jianshu.io/upload_images/2284556-5d704bdbc5aeeffb",
            "http://upload-images.jianshu.io/upload_images/2284556-611f170fb6529919",
            "http://upload-images.jianshu.io/upload_images/2284556-6a2e96b6ca4e8398",
            "http://upload-images.jianshu.io/upload_images/2284556-6e554aa11a6f3619",
            "http://upload-images.jianshu.io/upload_images/2284556-accc93410576afdc",
            "http://upload-images.jianshu.io/upload_images/2284556-b66175c5797d3a98",
            "http://upload-images.jianshu.io/upload_images/2284556-b9766f2dd83288d4",
            "http://upload-images.jianshu.io/upload_images/2284556-dd61e122e9ce2557"
    };

    private static final String[] TEXTS = {
            "羽翼君",
            "拉拉",
            "凌之",
            "涵菱",
            "靖灵",
            "诗雁",
            "飞凝念阳",
            "念萱",
            "白雪",
            "傲露",
            "柔胤",
            "皓博",
            "枫振",
            "振然",
            "琪家",
            "涵菲",
            "曼彩",
            "鑫静",
            "冰柏",
            "萱优",
            "呈雪",
            "韵彦",
            "瑶雯",
            "琬露",
            "楠娜",
            "梦茜",
            "桂欣",
            "芙彤",
            "初静",
            "欣",
            "明卿城月、倾城陌",
            "┌;ωǒ缺嗳`灬.°",
            "静月思怜梦清幽丶",
            "有卞白贤你特么还想发光",
            "暮色伊人。",
            "璀璨人生",
            "青衣沽酒醉风尘",
            "短发美比我在这i",
            "~花舞う街で~",
            "听雨潇潇",
            "贩卖后悔药i",
            "心泉",
            "爱你岂会lay",
            "花凌若别离",
            "鹿痴≠路痴i",
            "゛千城墨白ぅ.",
            "心里向阳-无惧悲伤°",
            "丑化小丑不丑。",
            "彡炫灬月影萧梦灬",
            "飘扬的青春",
            "树深时见影",
            "透过骨z1里的傲 つ",
            "花开半夏锁琉璃°",
            "♂ωǒ缺嗳♂",
            "烟雨寒~伊人醉",
            "飞翔的企鹅",
            "妖视觉〃",
            "天若有情天亦老。",
            "竹妖妖ヅ鸢尾",
            "奈何桥旁风满袖",
            "换一个梦",
            "青丘。白浅",
            "我生性薄凉并且坚强",
            "_斷橋殘影",
            "耻、 ￣笑",
            "用心生活i",
            "黎夕旧梦",
            "＃〃自刎≈.",
            "[醉落夕风]",
            "对你好",
            "╯轻影映红窗",
            "[醉落夕风]",
            "初三，拼了。",
            "墨烟三色倾人城。",
            "预见你！",
            "失败的谎言,",
            "夜清冷、一曲。",
            "执着于有你的执着i",
            "静若繁花",
            "我要当女子汉！",
            "夏漠、秋雨",
            "别嘲笑胖女孩！",
            "倾城一世繁花落",
            "别停留i",
            "爱情公寓火不过青果学院",
            "淡然一身，看透尘世纠纷",
            "我是手机达人",
            "爱4太给力",
            "默 ’＿哀、",
            "从不低调@",
            "mm要吃大饼膜",
            "Govern (统治)",
            "爱情专利",
            "别太耀眼°",
            "转身&未来",
            "不回头的倔强",
            "让世界为我而改变",
            "妞,狠天真",
            "与寂寞抗衡",
            "@ 友尽,！",
            "女王驾到i",
            "′指间de落寞.",
            "求佛不如拜我",
            "單身リ天涯",
            "不败的意志",
            "秒杀你的自大≈",
            "放荡不羁就是边爷i",
            "钻石心i",
            "枪毙走狗@",
            "↗奋发向上",
            "笑对世间狗",
            "超越梦想、",
            "分了、我来合。",
            "╭ァ幸福由╮我独家赞助",
            "别做逃兵",
            "超越梦想、"
    };


    /**
     * 评论数据来源王思聪微博
     * http://weibo.com/1826792401/EhZeqks7k
     */
    private static final String[] COMMENT_DATAS = ("你千万不要结婚，否则狗仔天天报道你出轨sp" +
            "点赞抽一个晚上来我被窝看夜光羽毛球sp" +
            "剛從信號很差的球场回來，看到這麼不靠譜的事情實在太可笑了，猜測分析不少，但抱歉都不是事實，難為有心人這麼操心了，沒想到會引發這樣的誤會，只能說以後教打羽毛球，再重要也不能在晚上教，不能在房間教，長了個經驗，謝謝提醒了。 sp" +
            "还能不能好好玩耍了sp" +
            "谁知道王思聪的新电话号码，我现在联系不上他了。我是京东客服工号390，他退回的充气娃娃我们已经修好了，这己是第9次为他维修了！下次温柔点，毕竟不是钢铁做的。寄回来的时候现场女性工作人员看了都争着要联系方式，场面都快控制不住了！下次再搞破，我们京东，不再为他服务。请他到补胎的地方去补。sp" +
            "哈哈你妹啊，傻了吧唧的sp" +
            "我好像知道了什么sp" +
            "ki你妈逼啊kimi  一群脑残疯狂yy  妈的见谁都说是水军  水你妈逼水sp" +
            "大家让让 纪检委先说！！sp" +
            "超级丹怎么就一下子变成了操鸡丹了呢！老婆怀孕期间出轨，还被抓拍到亲热场景。还有，再不治理雾霾，以后就没什么狗仔队了，都他妈的看不清人sp" +
            "kimi走好sp" +
            "王思聪不是人。sp" +
            "王思聪，你舍得更博了阿。还以为你怕了。没有想到装了那么久的乌龟，今天舍得把头露出来阿，你这样害米，你也会遭报应的。不是不报，是时候未到，我会看着你被垮下台的那一天sp" +
            "王思聪，你不是做了乌龟了吗？怎么人家林丹那点小事就把你个狗日的炸出来了呢？乔任梁那么大的事，你确却不出来，钻在你的乌龟壳里！既然出来了，就来解释一下哈！sp" +
            "你上次发微博我还是处男啊sp" +
            "我很纳闷，乔任梁的事就这么过去了？？？怎么评论里风向都变了？？？sp" +
            "还有人记得他和乔任梁的事吗？sp" +
            "害死乔任梁 的首富儿子，报应来了。万达海外投资被拒sp" +
            "我三个问题1.王思聪你为什么还不出来反驳？屁点事你都会评头论足一番，把你黑成这样你不说话？ 2.无风不起浪？嗯？人家都针对你王思聪？为什么不说是李思聪，赵思聪害死乔任梁的？ 舆论止于智者你妈了个逼？凶手没事逝者怎么安息？ 3.我就看我这条什么时候被删sp" +
            "除了出轨李宗伟 林丹出轨谁都不能接受sp" +
            "大家继续盯着马蓉，这个时候千万不能让马蓉钻了空子！sp" +
            "妈的 水军真多 乔任梁的事我们不会忘的sp" +
            "呦舍得发微博啦？我还以为杀了人不敢出来了呢,你这人渣害死Kimi等遭报应把你！你瞒的了一时你瞒不了一世！贱人自由天收！！sp" +
            "每天都诅咒你一定不得好死@王思聪sp" +
            "杀人犯@王思聪sp" +
            "乔任梁粉丝是邪教？我尊重逝者，但看你们的评论太脑残了！有什么证据拿去报案，整天在网上匿名随意骂人随意诅咒别人还有理了？！我不是王思聪的粉，点进热搜看见热评实在看不下去了。素质和智商简直不能忍！sp" +
            "你笑是因为你觉得你自己的梗已经过去了是吗？sp" +
            "狗逼，败类，你敢杀人不敢承认你不是还没死吗！自己不会说话了让臭水水那个婊子@香水水V 和程青松那个蹭热度的败类@电影人程青松 忙前忙后给你擦腚，一天到晚跟个疯狗没什么两样，一有人仗义执言就出来满嘴喷粪，你丫敢不删我们评论吗，敢不压我们的超级话题吗？sp" +
            "不是你干的，是他自己走的..sp" +
            "你可还记得乔任梁，亡死匆、sp" +
            "当我转身倔强离开的时候 没能遇见以后多难受 以为天空海阔可以找回自由 现实总叫人留下伤口 就在此刻不经意去想你的夜晚 失去牵挂的人心好乱 落入前尘往事眼泪反复纠缠 我的回忆有你剪不断 忘记你太难 想爱你太晚 我的生命留下遗憾 不想你太难 花开得太晚 回首爱已曲终人散 思念一步一步吞没像流沙sp" +
            "只有中国共产党。立党为公，执政为民，中国共产党一直在您身边。sp" +
            "乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁他一辈子都跟着你sp" +
            "大家来围观一下2016年 中国最轰动的杀人分尸案 参与者有哪些！替杀人犯说话的水军希望你们不要为了两个臭钱昧着良心说假话，天道有轮回 苍天绕过谁！sp" +
            "kimi晚上回来把王狗带走sp" +
            "不忙着删评了？对了，钱花到了，有人替你删。sp" +
            "思聪的评论真是吓人，中国现在的网民都这么可怕么，随便一点话就能带起节奏，诅咒人的话一条接一条，不可思议sp" +
            "乔任梁的事还没弄明白呢！！！别他妈的林丹不林丹的，仙丹都掩盖不了你的罪行sp" +
            "你他妈的笑个啥？死变态，恶魔，垃圾，早晚天打五雷轰。可怜你老爸一大把年纪有你这么个龌龊致极的垃圾儿子。sp" +
            "以为你缩起来了，知道吗？天道轮回，即使你用法压米，但你要记住，邪不胜正啊。就像你家亲戚，逃了二十年，终逃不过法网。你也会有那么一天。当然不是我咒你的哈，米看着呢。sp" +
            "原来马蓉才是预言帝sp" +
            "没事，我就说我在房间教她打羽毛球sp" +
            "刘恺威真应该好好感谢林丹sp" +
            "你这一辈子不得好死sp" +
            "乔任梁的事情 终究被淡忘sp" +
            "夜深人静时，你可否听到过乔任梁的哭泣@王思聪sp" +
            "我也很纳闷为什么乔任梁的事到现在都沸沸扬扬，你都不敢出来说话，这他妈的要是以前娱乐圈哪个明星出来放个屁你都得赶紧过来闻一闻调侃一下，这不是你撕葱的性格啊，是心虚吗？sp" +
            "所以，楼上这些水军们。亡撕葱给你们开的工资应该很高很高吧，记得日结，现在社会一天一个样。没准明天他就吃牢饭去了。sp" +
            "乔真的很可怜，所以消息都被封。sp" +
            "乔任梁粉丝就是孬种…  。 乔任梁有这种粉丝 ，也是倒了八辈子的血霉，死了还要被自己的粉丝消费。sp" +
            "杀人犯出来了快点抓起来sp" +
            "杀人犯发说说了我的天阿sp" +
            "神预测！林丹现在估计想打死马蓉。sp" +
            "@王思聪  聪哥借点钱花 有急事sp" +
            "马蓉:我B都不要了，我还要脸？sp" +
            "一群王八蛋把Kimi换给我们sp" +
            "图片评论sp" +
            "如果kimi是王思聪弄死的话，大张伟都死了一万遍了好么sp" +
            "亲爱的米，来看你了sp" +
            "图片评论sp" +
            "你不知道现在都成了网络公认的杀人犯吗  你还不来新闻发布会澄清？你怕什么 发一张图 发几个哈哈字好？真的太不符合你个性 好吧 我觉得你心虚有没有？呵呵sp" +
            "键盘侠真他妈的多，你们是亲眼看见王思聪杀人啊？有本事就拿证据，在评论下bb有什么卵用，一帮脑残。sp" +
            "帅sp" +
            "马上要开天眼了sp" +
            "我日你妈sp" +
            "去你妈逼的，先保护好自己小命吧，夜里乔任梁来找你sp" +
            "林丹出轨并不可怕，我怕的是三十晚上的祝福太多，你会看不到我的问候，我怕初一的鞭炮太吵，你会听不到我的祝福，我怕初二的菜肴太香，你会看不到我的短信，所以选择现在给你送来新年祝福，祝您新春愉快，万事如意！提前100天给您拜个早年，新年快乐！2017年鸡年sp" +
            "@王思聪 给二老个交代！sp" +
            "作为一个集团董事、一个公众人物、一个国家的首富之子，我实在想不通到底是什么理由要他顶着杀人犯的骂名而不作回应！除了心虚、除了有着比杀人犯头衔更让自己无力承担的罪行而不得不默不作声的原因以外，我真的想不到是为何！毕竟两权相害取其轻嘛！@王思聪sp" +
            "不要以为kimi的事情我们都忘记了，请这么多水军也没有用，事实就是事实.人在做天在看 希望你晚上睡觉可以睡的安稳sp" +
            "其实你们误都会林丹了，他只不过想在退役后转行时装设计！视频中显然是他在帮服装模特量三围。当忘记带布尺时，手测是一位正常的裁缝都必须掌握的基本技能。他这么努力请不要黑他！请不要在黑他了！！！！sp" +
            "以王思聪性格，说他丑他都会回怼网友，现在出现这么多说他害死乔任梁的评论，他如果心里没有鬼，早就回怼网友了，sp" +
            "图片评论sp" +
            "丧尽天良的畜生，敢做不敢当啊看看你那评论区跟个乱葬岗子没什么区别，祖宗18代都要被从坟里骂出来了，你还他妈的龟缩着呢！这还是那个爱撕B，瞎政委的首富毒子吗你老子都快散尽家财了来给你擦腚，想出什么狗屁的名人保护！杀人灭口，还要用邪术压魂！泯灭人性的人渣败类！sp" +
            "图片评论sp" +
            "把提到kimi的全赞了一遍…不要说没脑子之类的…首先疑点太多…其次热搜降的速度快到吓人sp" +
            "天网恢恢 会有报应的 贱狗sp" +
            "你就是杀死kimi的人 王思聪sp" +
            "你别以为事情过去了，我们会无时无刻提醒你 ，乔任梁，这三个字，你甩不掉。乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任梁乔任sp" +
            "看完评论我就他妈想说一句 这的智障真的多sp" +
            "你会一命赔一命的  你活不了多久的sp" +
            "王思聪，我这辈子，下辈子，下下辈子都诅咒你不得好死，还我乔命来，你可以有钱你可以任性，但是你怎么可以没有人性！王思聪我诅咒你死无葬身之地！我诅咒你sp" +
            "不能忘记你！  我的米sp" +
            "看看看sp" +
            "王狗军真多，我们一辈子刷，你就一辈子删，乔任梁一辈子跟着你！sp" +
            "你还有脸发微博，不是应该澄清的吗？杀人犯sp" +
            "为什么王思聪的微博评论都这么不堪入目？人家杀没杀人管我们什么事？自然有人处理这个案件，你们一个个这么厉害还要警察干嘛？就算没结果你们也应该喷这个社会。我不是王的粉丝也不是乔的黑粉。我只是站在一个正常人的立场来说这些。你们看这些评论就不觉的很很很很很弱智很很很很很无脑？sp" +
            "你终于出声啦，我乔要来带你了！sp" +
            "你以为能转移大家的关注吗？你一辈子都会不得安宁，杀人凶手sp" +
            "真是够了，一直说人是杀人犯，你们倒是举报啊，一堆个瞎鸡吧扯淡的东西，脑残sp" +
            "你怎么还有逼脸笑，还有逼脸活，长那个逼样，还是快去死吧，没有人会放过你sp" +
            "你竟然还好意思更博？麻烦你对kimi的事回复一下sp" +
            "我知道你在笑什么 你是觉得你成功转移注意力么？想多了 ！Kimi Kimi Kimi在呢.sp" +
            "我的天，乔的粉丝怎么这么脑残啊！无法理喻啊！那些所谓的真相，明明就很牵强，为什么还有人信？之前说乔是因X虐而死，粉丝一拥而上谴责网络暴力。现在呢，直接满口生殖器咒骂别人。替Kimi心疼有群智障粉丝。sp" +
            "死与梅毒，艾滋病。sp" +
            "道歉不接受，谢谢！！！渣男sp" +
            "心疼王思聪一分钟  评论下面各种福尔摩斯名侦探 有理有据怎么不去报警？在微博上发乔任梁遗照就显得你沉痛哀悼？还有人p王思聪遗照  微博如若点赞超过5000 已经可以起诉将其作为证据 脑子是个好东西那么问题来了  赵薇和王思聪哪个才是操纵宇宙的最大势力sp" +
            "王思聪他把kimi杀了，因为他有钱把所有的事都掩盖下去了！kimi遗照没有胳膊没有腿脖子上全是项圈的嘞痕！这一定是赵薇联合王思聪想要统治宇宙的阴谋！因为乔任梁不小心偷听到这个计划！所以被王思聪灭口了！所以我仿佛听到有人骂我智障sp" +
            "你活了？？sp" +
            "图片评论sp" +
            "撒泼炒作????这次站王健林???没毛病sp" +
            "冯小刚从北京老炮儿变成了北京胡同泼皮了sp" +
            "明天开始??万达来个零排片sp" +
            "这次站万达 冯小刚越来越阴阳怪气了sp" +
            "这次，我站万达。sp" +
            "因华谊向广电诉求 要求给11.18上映的《我不是潘金莲》留出排片空间 原定同日上映的《哈利波特》外传#神奇动物在哪里#由11.18推迟到11.25上映 而克林特·伊斯特伍德导演 汤姆·汉克斯主演的《萨利机长》也顺延推迟到12月9日上映sp" +
            "赞我的人三天内必会找到对象 ，吃什么都不胖 ，月薪翻三倍，考试不挂科sp" +
            "华谊垄断百花奖怎么不出来说说。冯小刚吃相太难看。每次都要炒作个没完没了。sp" +
            "讲真这次我站你这边sp" +
            "思聪:如你所愿。那就零排场sp" +
            "这次我站王思聪sp" +
            "冯导稍显狭隘了，有一种你不偏爱我就是欺负我的优越感。总是那副谁都不服，四处喷的样，并不觉得真性情，相反有点小家子气了。人的胸襟和眼界体现哪啊？在电影里，也在处世的态度里。能体会那种“我的片就最好”想要证明自己的心情，但是这个世界不是你自己一人的，你的也不是唯一的。sp" +
            "你们在救林丹么我的天sp" +
            "这一个破电影 炒好几个月了 没完没了sp" +
            "虽然不喜欢你 但这次我站你sp" +
            "老公 操他！！sp" +
            "娱乐圈本来就鱼龙混杂，偏偏有人倚老卖老，李安世界顶级导演在万达排片那么低，都没有说一句话，不知道小刚你这逼逼什么 ，生怕别人看不出来你袒护范冰冰，在意票房就把电影拍好啊，好电影还怕没票房？换句话说万达是人家自己家开的，又不是国家的。站万达sp" +
            "支持你！零排片！希望成全冯小刚sp" +
            "女主换成林更新五分钟排一场！sp" +
            "从来都是我主动撕别人，这次居然有人找上门来了，还是个硬茬子sp" +
            "冯小刚为了炒作新片也是够了！请问范冰冰演的电影能好到哪里去？也只能靠这些手段拉拉人气了！这次站王思聪！sp" +
            "我的聪不得了sp" +
            "这个信语气真的有点恶心了sp" +
            "这次我站万达sp" +
            "就喜欢你这样直来直去的说话 好理解sp" +
            "明天就给他零拍片，说话语气太恶心了。sp" +
            "这次错不在万达也不在冯小刚，问题在于听见范冰冰演的就觉得是烂片！原谅我的直白。。。莫名想起骗钱的封神榜sp" +
            "冯导吃相各种难看。给零排片吧，这是冯导自己的要求。sp" +
            "哼，别以为我看不出来这是华谊和万达拍的新大片《拯救林丹》！！！sp" +
            "这话没毛病，夏洛时第一天万达一天只排一场，第三天半小时一场，酒香不怕巷子深。sp" +
            "终于有人对自认电影界权威说话了，中国电影是该整顿一下了sp" +
            "如他所愿 给零排片吧sp" +
            "这回冯导是真丢面儿。sp" +
            "说的很对，电影需要的是好评，和排多少场没关系！sp" +
            "我家开的小卖店，不卖你家矿泉水怎么了sp" +
            "哈哈哈哈站思聪这次???华谊不对在先sp" +
            "想了很久也想不出来发点什么，拜年又显的太俗了，干脆给大家提前上柱香吧！sp" +
            "这次我站万达，顶你们sp" +
            "这次站你 没毛病sp" +
            "不好意思，我儿子聪聪喜欢看好莱坞，我们家的家庭影院想放啥就放啥，有本事你们也开sp" +
            "冯小刚真的挺恶心，话语恶心的一逼，他就故意去怼万达，让网络都炸开锅，然后炒作他的电影，挺心机的老东西，60岁人了整得都是啥玩意右上角来一波，赞我的男人鸡鸡长5公分，女的咪咪大3号sp" +
            "没毛病 冯导别利用网络舆论啊sp" +
            "李安新片降到3.7%人家说啥了？全国40%排片还嫌少，两部引进片被你挤的推档，冯大导演吃相太难看。建议广电总局每年11月到春节，设立冯小刚电影保护月，其他影片不许上映。sp" +
            "这次我站万达本来要看我不是潘金莲的突然不想看了sp" +
            "支持，好看就多排，赚钱谁不想，电影不好看排的少就是打压国产影片？sp" +
            "好片自然有人去看sp" +
            "王思聪 这点你挺爷们，这个时候出来帮帮你的父亲，这也是正经事儿啊。不管他是个鸡巴导演或还是导管，我挺你，这次支持你到底，给我打败冯篮子。sp" +
            "希望这次能给冯小刚一个教训，要不然他会得寸进尺。你父亲肯定不方便回复了，毕竟他冯小刚还没有这个资格。但是王思聪你这个时候必须冲上去，哥们虽然人不多，我挺你！顶你！sp" +
            "对，就是这样sp" +
            "第一sp" +
            "我是来看林丹的，走错了sp" +
            "就你这票房傻子才排sp" +
            "人家思聪怎么就有信号呢？sp" +
            "把华谊收了吧sp" +
            "讲真，冯导满嘴透漏出的委屈和优越感头一次让我觉得不给他排片是对的。sp" +
            "演了个老炮，真把自己当混混，sp" +
            "这就是为什么冯小刚成不了李安的原因sp" +
            "王思聪的老婆请赞我sp" +
            "今天真的是被冯大捣给恶心到了……本来还想去看一下，这下真的不会去看了sp" +
            "上次恶意攻击我们华师大，这次又攻击万达，我也对这电影没好感了sp" +
            "冯小刚现在比张艺谋还陈凯歌了sp" +
            "思聪这个小屌丝，说话还挺中听，小刚的电影现在是越来越难看了sp" +
            "我永远忘不了冯小刚来我们学校 我们等了他一下午 从两点开始到下午五六点 说飞机晚点了到了学校 七不情愿八不耐烦 他还给我们甩脸子 一副大牌样？主持人给了很多台阶缓和气氛 一直不给脸 真当自己是“六爷”？当时就是大写的尴尬 学生都不想待在里面要走 保安把门关了 不让出就为了撑住入座率sp" +
            "句句在理呢。sp" +
            "王思聪问禅师:我干得过山里放羊的老炮吗？禅师指指远处的山峰。王思聪说:大师，您的意思是让我别怕，山再高也是能爬过去的。禅师说:山是你家的。sp" +
            "思聪很有脑子，我目测思聪是从冯小刚的评论里先观察了一下，然后把热评都复制粘贴再加工。这明显迎合了大众的思想，也为自家公司发了声。吸取了孙杨事件的教训啊sp" +
            "潘金莲是中国古代女人的的耻辱，王思聪没毛病！万达更没毛病！挺！sp" +
            "老公 ！给他烂片0排片，如他所愿??贱人就是矫情??sp" +
            "就冯小刚拍个电影事儿多，好像全国人民都围着他转才行sp" +
            "厉害了王思聪sp" +
            "华谊得罪人家在先，这是一报还一报，王健林大大没毛病。sp" +
            "不会去看，我相信范冰冰的演技sp" +
            "我也感觉冯小刚想煽动网络舆论，，但好像骂他的更多点儿，毕竟路人的眼睛都是雪亮的，搬起石头砸自己的脚？sp" +
            "《比利林恩》的票房才多少？！国内大多导演跟李安的区别就在这，包括他！sp" +
            "为什么就一定要给你排百分之四十呢？其他电影也要上座率啊，那你怎么不为一些优秀的小电影而上不了院线而呐喊呢？《心迷宫》才几天就全部下线，还不是被某些同等地位大导烂片霸市，电影圈是一谭混水，别越搅越臭sp" +
            "记得之前夏洛特烦恼刚出头一天去影院买票，尼玛一天居然就排一场。等到第三天再看排片直接飙升到每半小时一场。好醋还怕巷子深，王健林是生意人自然不会跟钱过不去，如若真是好片何必苦口婆心，如果只为名誉何必在乎排片多少，阿甘正传从未上映我却看了十三遍。转自一位网友的评论，我觉得说的很有道理sp" +
            "直来直去的好sp" +
            "我虽然偷你老婆了，可你不能不卖我饼吃，我会饿死的。sp" +
            "是的没错啊 自抬身价 烂片真的没人想去看啊 哪怕你前期宣传再多再好 真正的好片你不炒作还是有人照样去买单sp" +
            "奴家就睡过两个男人，为啥要范冰冰演？这不是羞辱奴家么！ 应该让奴家来演一出，我不是范冰冰！sp" +
            "人家王思聪这不找爸爸去了吗！sp" +
            "想想范冰冰那张妩媚的脸，一口一个小女子，装可怜，求同情的绿茶一览无遗，跟冯小刚这个老大炮的老炮真是绝配啊着万达sp" +
            "这次我站万达??万达没有错sp" +
            "不够硬气啊我聪，全部暂停才叫狠sp" +
            "很多人讨厌王思聪.反正我不讨厌.我只知道他每次就事论事.你们说是吧.我占老公这边.你们呢sp" +
            "把《神奇动物在哪里》挤到25号，太可恶了。。。万达给他零排片。。sp" +
            "排片是电影院的事，你以为电影院是你家开的？sp" +
            "华宜两兄弟当年西游降魔的时候 许诺票房超五亿 给予周星驰票房分账！可后来分了吗？欺善怕恶？sp" +
            "王思聪的三观其实挺正的，就是有些人不愿意承认有钱人连觉悟都比他们高一点而已。世界早就变了，不只有寒门子弟才苦读书，官二代、富二代也不全是不学无术的纨绔子弟，而且他们的眼界往往比普通人高很多。sp" +
            "旗鼓相当叫撕逼??实力不均是碰瓷????这个我服sp" +
            "无条件站万达，游戏都有规则，谁违规了受惩罚都得忍着，什么事没代价？电影想看也可以去其他影城看啊！如此！sp" +
            "我相信范冰冰的演技，所以不会去看sp" +
            "儿子，好样的！没白养！sp" +
            "《潘金莲》牛逼随意调档，挤走《神奇动物在哪里》和《海洋奇缘》两部好莱坞和迪斯尼大片，本来是全球同步上映甚至领先全球上映的影片，现在整整落后了一周！?还有别忘了当年卖不动的《1942》是如何压的李安刚上映的《少年派的奇幻漂流》每天就一场排片的，好在少年派场场上座100%最后实现排片逆袭sp" +
            "就单单从王思聪称以前的员工为“高管”，冯小刚称以前的员工为“小墙皮”，王中磊更是直接爆出自己员工的名字，就能看出谁是有教养，有涵养的人，这次挺万达，支持王思聪！sp" +
            "潘金莲要是知道冯小刚这么消费她名字 都得从土里站起来sp" +
            "这次我又站思聪了，不为别的，就因为思聪说的我能听懂，冯导说的文诌诌，翻译不明白，理解费成本sp" +
            "刚看完电影，无力吐槽，3分不能再高了，那个圆形画面真的也是醉了，故事毫无逻辑sp" +
            "没毛病 谁能和钱过不去呢 挖了墙角还想讨好处 阴阳怪气字里行间透露着王总真小气 我打你一下然后说您身宽体胖我那小拳头您也计较 这不搞笑嘛sp" +
            "确实恶心 上个月是碰瓷华师 现在又碰瓷万达 不知道从什么时候开始大导演冯小刚特别在乎票房了 说好的艺术性呢？每次电影上映前都要和片方联合搞事情 去年老炮儿排位也是 引导两家鲜肉粉撕逼 我的天哦 服气 今年又是借百年名校华师炒作 恶心极了sp" +
            "这次站王健林，看了几个采访，崇拜的不行。有头脑，有魄力！说话能说到点子上！王健林这是没微博，要是有微博，圈粉肯定比冯小刚多吧！最后，求万达别上这种国产烂片了，不止这一部，很多电影都是花了钱进去买睡眠质量的。我们不是不支持国产电影，但你们也得对得起我们的支持啊！这和国足是一个道理吧sp" +
            "回应很强势啊 思聪哥sp" +
            "王思聪，是你杀了kimi，人在做天在看，你会遭报应的，我们的kimi死的很惨，谁挺你谁一样会遭报应sp").split("sp");

    public static String[] getImages() {
        return IMAGES;
    }

    public static String getImage(int pos) {
        if (pos >= 0 && pos < IMAGES.length) {
            return IMAGES[pos];
        }
        return "";
    }

    public static String[] getTexts() {
        return TEXTS;
    }

    public static String getText(int pos) {
        if (pos >= 0 && pos < TEXTS.length) {
            return TEXTS[pos];
        }
        return "";
    }


    public static String[] getCommentDatas() {
        KLog.d();
        return COMMENT_DATAS;
    }

    public static String getCommentText(int pos) {
        if (pos >= 0 && pos < COMMENT_DATAS.length) {
            return COMMENT_DATAS[pos];
        }
        return "";
    }

}
